Tekla Open API Reference for Tekla Structures 2025
Analysis.GetConnectionStatus Method
 Checks the connection status of the Tekla Structures process.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetConnectionStatus()
Public Function GetConnectionStatus As Boolean
Return Value
Type: Boolean
True if a proper connection to the Tekla Structures process has been established. Currently there's no way to re-establish the connection.
See Also
Reference
Analysis Class
Tekla.Structures.Analysis Namespace